import csv
import random
from faker import Faker

male_patronymics = [
    "Іванович", "Петрович", "Миколайович", "Олександрович", "Дмитрович",
    "Андрійович", "Сергійович", "Вікторович", "Олегович", "Юрійович",
    "Васильович", "Михайлич", "Григорович", "Володимирович", "Романович",
    "Богданович", "Данилович", "Тарасович", "Остапович", "Степанович",
    "Мирославович", "В'ячеславович", "Едуардович", "Русланович", "Антонович",
    "Олексійович", "Віталійович", "Валерійович", "Ігорович", "Владиславович",
    "Мирославович", "В'ячеславович", "Едуардович", "Русланович", "Антонович",
    "Олексійович", "Віталійович", "Валерійович", "Ігорович", "Владиславович",
    "Мирославович", "В'ячеславович", "Едуардович", "Русланович", "Антонович",
    "Олексійович", "Віталійович", "Валерійович", "Ігорович", "Владиславович",
    "Мирославович", "В'ячеславович", "Едуардович", "Русланович", "Антонович"
]

female_patronymics = [
    "Іванівна", "Петрівна", "Миколаївна", "Олександрівна", "Дмитрівна",
    "Андріївна", "Сергіївна", "Вікторівна", "Олегівна", "Юріївна",
    "Василівна", "Михайлівна", "Григорівна", "Володимирівна", "Романівна",
    "Богданівна", "Данилівна", "Тарасівна", "Остапівна", "Степанівна",
    "Мирославівна", "В'ячеславівна", "Едуардівна", "Русланівна", "Антонівна",
    "Олексіївна", "Віталіївна", "Валеріївна", "Ігорівна", "Владиславівна",
    "Мирославівна", "В'ячеславівна", "Едуардівна", "Русланівна", "Антонівна",
    "Олексіївна", "Віталіївна", "Валеріївна", "Ігорівна", "Владиславівна",
    "Мирославівна", "В'ячеславівна", "Едуардівна", "Русланівна", "Антонівна",
    "Олексіївна", "Віталіївна", "Валеріївна", "Ігорівна", "Владиславівна"
]

fake = Faker('uk_UA')

num_records = 500

num_female = int(0.4 * num_records)
num_male = num_records - num_female

def generate_birthdate():
    return fake.date_between(start_date='-85y', end_date='-15y')

records = []

for _ in range(num_female):
    records.append([
        fake.last_name_female(),
        fake.first_name_female(),
        random.choice(female_patronymics),
        'Жіноча',
        generate_birthdate(),
        fake.job(),
        fake.city(),
        fake.address(),
        fake.phone_number(),
        fake.email()
    ])

for _ in range(num_male):
    records.append([
        fake.last_name_male(),
        fake.first_name_male(),
        random.choice(male_patronymics),
        'Чоловіча',
        generate_birthdate(),
        fake.job(),
        fake.city(),
        fake.address(),
        fake.phone_number(),
        fake.email()
    ])

random.shuffle(records)

with open('data.csv', mode='w', newline='', encoding='utf-8') as file:
    writer = csv.writer(file)
    writer.writerow(['Прізвище', 'Ім’я', 'По батькові', 'Стать', 'Дата народження', 'Посада', 'Місто проживання', 'Адреса проживання', 'Телефон', 'Email'])
    writer.writerows(records)

print("Файл data.csv успішно створено.")
